{
  "title": "Solving your ESP board's communication errors (Try these in order)",
  "aliases": [
    "espcomm",
    "ESPcomm",
    "ESPcommerror",
    "espcommerror"
  ],
  "fields": [
    {
      "name": "1. Is your Serial monitor open?",
      "value": "If it is, close it. This allows your IDE to upload sketches without conflicts with the Serial Monitor."
    },
    {
      "name": "2. Have you selected the right port in your IDE? ",
      "value": "You could have selected something that is **not** your Arduino. Change the port in the Arduino IDE by going into Tools -> Port."
    },
    {
      "name": "3. Have you selected the right board in your IDE?",
      "value": "You need to select the right board and model."
    },
    {
      "name": "4. Is your Serial monitor showing gibberish?",
      "value": "Try setting it to the correct baud rate (At the bottom right corner of the Serial monitor). Most examples use 115200 baud."
    },
    {
      "name": "5. Is anything connected to your Tx and Rx pins?",
      "value": "If there is, try removing everything connected to them."
    },
    {
      "name": "6. Have you tried holding down the BOOT/FLASH button?",
      "value": "Try Holding down the BOOT/FLASH button before uploading."
    },
    {
      "name": "7. Are there any problems with your wiring?",
      "value": "Check if there are any wiring errors or loose connections (Note:- if you are using an FTDI Board, FTDI TX and RX pins must be cross-connected with the ESP Tx and Rx pins(TX goes to RX))."
    },
    {
      "name": "8. Cant see your ESP's COM Port?",
      "value": "This often means you don’t have the USB drivers installed. Take a closer look at the USB chip and check its name, Go to Google and search for your particular chip to find the drivers and install them in your operating system. If you have the CP2102 chip, here are the [official drivers](https://www.silabs.com/developers/usb-to-uart-bridge-vcp-drivers)."
    },
    {
      "name": "Still not fixed?",
      "value": "Check out these troubleshooting guides for your respective board:- [ESP32](https://randomnerdtutorials.com/esp32-troubleshooting-guide/#:~:text=When%20you%20try%20to%20upload,button%20in%20your%20ESP32%20board), [ESP32 CAM](https://randomnerdtutorials.com/esp32-cam-troubleshooting-guide/#:~:text=If%20you%20get%20this%20exact,times%2C%20might%20solve%20the%20issue.) and [ESP8266](https://randomnerdtutorials.com/esp8266-troubleshooting-guide/)."
    }
  ],
  "image": ""
}
